import React, {Component} from 'react';




class Fr1 extends Component {

render(){
    return(
        <div className={"moooooooopppp"}>
            Соглашение об оказании Преподавателям услуг по использованию
технологической площадки и инфраструктуры My Dars 
(«Соглашение с Преподавателями»)

г. Ташкент                
Стороны:                                                              
ООО «My Dars», созданная и действующая по законодательству Республики Узбекистан, ИНН 307897255, расположенная по почтовому адресу: Республика Узбекистан 100031, ул. Кухинур, Богсарой махаля, Яккасарайский район, дом 1/1, осуществляющий деятельность по предоставлению технологической площадки и инфраструктуры для взаимодействия Преподавателей и Пользователей, расположенная по веб-адресу mydars.uz (далее именуемая — «MY DARS») с одной стороны, и Лицо, пользующееся данным сервисом для поиска Клиентов и взаимодействия с ними (далее — «Преподаватель») с другой стороны, а вместе именуемые "Стороны", руководствуясь действующим законодательством РУз, в том числе постановлением Президента РУз. №ПП-4742 от 08.06.2020 г. «О мерах по упрощению государственного регулирования предпринимательской деятельности и самозанятости» и гражданским кодексом РУз., заключили настоящее Соглашение о нижеследующем:  
Термины и определения:
MY DARS – Платформа (технологическая площадка) предоставляющая инфраструктуру для взаимодействия Преподавателя и Пользователей/Клиентов, в режиме онлайн. Владелец торговой маркой MY DARS является юридическое лицо OOO «My Dars» 
Пользователь – физическое лицо, резиденты, нерезиденты Республики Узбекистан, лица без гражданства, которое по собственному желанию, на возмездной основе пользуется услугами Преподавателя(ей) и услугами My Dars. Пользователем может быть частное физическое лицо, сотрудник компании (Клиента), конечный потребитель услуг Преподавателя и услуг My Dars.
Клиент – физическое или юридическое лицо являющий плательщиком услуг Преподавателя и услуг My Dars. Физическое лицо, которое выступает в качестве плательщика услуг Преподавателя в интересах Пользователя, должно быть совершеннолетним, дееспособным, имеющим все права на заключения сделки на оказание возмездных услуг. Клиент, осуществляющий оплату за Пользователя обязан предоставить документы, подтверждающие родство с Пользователем либо иное основание для права осуществления платежа за Пользователя (свидетельство о рождении, приказ о назначении на должность, справка с место работы и пр.).
Преподаватель - физическое лицо, которое имеет статус самозанятого лица, по направления услуги репетитора, онлайн-тренер, онлайн-консультант, либо статус Индивидуального предпринимателя (ИП), действующий на основании патента, выданного уполномоченным органом Узбекистана, на право осуществления деятельности по направлению Услуги репетитора. Преподаватель обязан самостоятельно оказывать Услуги Пользователям (ученикам). 
Услуга MY DARS/Преподаватель – My Dars - которая предоставляет Пользователям (ученикам), Клиентам и Преподавателям услуги по использованию инфраструктуры онлайн-платформы, в виде ведения учета рейтинга Преподавателя; допустимой информации о Преподавателя; предоставления технологических возможностей общаться через текстовые сообщения и видеосвязь в режиме онлайн на платформе My Dars; обеспечение приёма оплаты от Клиента и произведение выплат Преподавателю. Также My Dars предоставляет возможный (негарантированный) поток Клиентов/Пользователей для Преподавателя.   Платформа My Dars, ни его создатели (разработчики, акционеры, учредители иные аффилированные лица), не предоставляют образовательные услуги и не имеет в штате Преподавателей, педагогов. 
Услуга Преподавателя – репетиторская услуга в режиме онлайн на платформе My Dars по различным темам и направлениям, которая оказывается самостоятельно Преподавателем. Услуга оказывается лицами, имеющими все разрешительные документы, образование, квалификацию, навыки. Преподаватель предоставляет Пользователю качественный контент, занятия, в выбранном, оплаченном Клиентом/Пользователем объёме и сроках. Преподаватель самостоятельно несет ответственность за качество Занятия.   
Занятие/урок – промежуток времени, в течение которого Преподаватель оказывает свои услуги Пользователю, в онлайн режиме через платформу My Dars, а также в оффлайн режиме, согласно условиям, определенным в настоящем Соглашении (п.3.2.2.).
1.	Принятие и изменение настоящего Соглашения
1.1.	Зарегистрировавшись на сайте MY DARSmydars.uz (далее — «Сайт») Преподаватель тем самым принимает настоящее Соглашение полностью, безоговорочно и безусловно.
1.2.	Любой Преподаватель, принимающий Соглашение, заверяет MY DARS о следующих обстоятельствах:
1.2.1.	он является совершеннолетним (достиг возраста полной дееспособности) согласно законодательству своей страны и обладает полной договорной дееспособностью; или 
1.2.2.	для заключения и выполнения Преподавателем настоящего Соглашения не требуется согласия или одобрения каких-либо третьих лиц.
MY DARS вправе в любой момент потребовать от Преподавателя предоставить информацию и документы, подтверждающие вышеприведённые заверения об обстоятельствах, а Пользователь обязуется предоставить такую информацию и документы в течение 14 (четырнадцать) дней с даты запроса. Информация и документы могут быть предоставлены в электронном (сканированном) варианте;
2. Предмет Соглашения
2.1. По настоящему соглашению Платформа предоставляет Преподавателям возмездный доступ к платформе MY DARS, а Преподаватели обязуются оказать свои услуги на данной платформе на условиях, с обязательствами, определенными в настоящем Соглашении с Преподавателями и в Пользовательском Соглашении с конечным пользователем об оказании услуг https://mydars.uz/docs/terms_and_conditions . В свою очередь Платформа обязуется организовать, предоставить условия и возможности для оказания Преподавателем Услуг и обеспечить их оплату, а Преподаватель обязуется оплатить Платформе за Услуги MY DARS.
3. Права и обязанности сторон
3.1. Преподаватель обязуется:
3.1.1. Оказать свои Услуги надлежащим образом, в объеме и сроки, предусмотренные настоящим соглашением и Пользовательским Соглашением с конечным пользователем об оказании услуг. Также Преподаватель самостоятельно обеспечивает Пользователя всеми учебными и раздаточными материалами в электронном виде, если это необходимо. 
3.1.2. Проводить Занятие по теме своего профиля, не отвлекаться на другие темы, проводить качественные Занятия, которые удовлетворяют потребностям Пользователей.
3.1.3. При оказании своих Услуг безоговорочно соблюдать всем условиям Этического кодекса https://mydars.uz/docs/ethical_code_of_tutors , которое принимается Преподавателем после ознакомления, на условиях оферты, до получения доступа к платформе MY DARS.  
3.1.4. Преподаватель по требованию Платформы предоставляет любую информацию о ходе исполнения/оказания Услуг.
3.1.5. Самостоятельно зарегистрироваться в органах налоговой службы, как самозанятое лицо либо получить свидетельство в качестве индивидуального предпринимателя, и самостоятельно, своевременно осуществлять обязательства по оплате социального налога/фиксированного налога. Платформа не выступает налоговым агентом, а также не обязан платить за Преподавателя, налоги от получаемой ими доходов. 
3.2. Преподаватель вправе:
3.2.1. Получать от Платформа разъяснения по вопросам, возникающим в ходе оказания услуг, и дополнительную информацию, необходимую для выполнения своих обязательств на платформе MY DARS. 
3.2.2. В случаи если при оказании Услуг Преподаватель, возникнут технические неполадки (не получается соединиться через внутреннюю систему видеосвязи и через сторонние сервисы), Преподаватель вправе провести занятие с Пользователем в режиме оффлайн (встречи), в удобном месте и времени. При этом, за организацию, оплату и иные последствия таких занятий Платформа (MY DARS) ответственности не несет. 
3.3. Платформа обязуется:
3.3.1. Обеспечить доступ Преподавателям на платформу MY DARS и пользоваться его возможностями, при успешном прохождении Преподавателем регистрации и модерации на платформе MY DARS;
3.3.2. Предоставить Преподавателям сведения необходимые для надлежащего оказания услуг.
3.3.3. Организовать получения Преподавателем денежных средств от оказанных им Услуг Пользователям, путем приёма оплаты от Клиентов/Пользователей через интернет-эквайринги и платёжные шлюзы банков.
3.4. Платформа вправе:
3.4.1. Получать от Преподавателя устные и письменные объяснения по вопросам, возникающим в ходе оказания Услуг.
3.4.2. Получить от Преподавателя личные данные, необходимые для предоставления доступа Преподавателям к платформе MY DARS и осуществления расчетов;
3.4.3. Платформа вправе не сотрудничать с Преподавателем(ями) и не предоставлять им доступ к платформе MY DARS, если Преподаватель(и) не соответствует критериям, требованиям определённых в функциях платформы MY DARS. При этом, Платформа вправе не объяснять причину отказа в сотрудничестве.
3.4.4. Платформа вправе вести учет популярности Преподавателя у Пользователей, в виде учета внутреннего алгоритма рейтинга, который постоянно совершенствуется/обновляется исходя из достижений Преподавателя. Рейтинг формируется из многих факторов: в том числе, но не ограничиваясь, от хорошо оформленного, привлекательного профиля; хорошо отснятого видеоприветствия; количества просмотров профиля Преподавателя; количества пробных занятий; количества заказов на пакет занятий; отзывы Пользователей. 
4. Оплата услуг и порядок расчетов
4.1. Стоимость услуг Преподавателя: Платформа (MY DARS) предоставляет Преподавателям возможность и право определения/установления стоимости Услуг Преподавателя и длительности занятия, при прохождении этапа регистрации на платформе MY DARS. 
4.1.1. Преподаватель вправе в дальнейшем изменить стоимость своих Услуг и длительность занятий, однако такие изменения не должны применяться к существующим заказам (оплаченным занятиям Пользователя), либо могут быть применены к таким занятиям только с согласия Клиента/Пользователя путем получения соответствующего согласия в Персональном кабинете. Если они согласятся, то произойдёт перерасчёт. Если откажутся, то занятия с этими учениками отменятся, они смогут перенести их к другому Преподавателю на площадке.
4.2. Стоимость услуг MY DARS зависит от количества часов занятий, в которые оказывались Услуги Преподавателя на платформе MY DARS, из расчета:
- от 0 до 80 проведённых часов – 15% от Стоимости услуг Преподавателя;
- от 81 до 200 проведённых часов – 13% от Стоимости услуг Преподавателя;
- от 201 и более проведённых часов – 10% от Стоимости услуг Преподавателя.
4.3. Платформа с помощью технических возможностей принимает оплату от Клиентов/Пользователей, и осуществляет выплату Преподавателям только за успешно проведенные занятие, при отсутствии каких-либо претензий со стороны Пользователей, после удержания причитающейся суммы за Услуги MY DARS.
4.4. Порядок расчета: Платформа обязуется выплатить сумму, подлежащая выплате Преподавателям, за успешно проведенные занятия за предыдущий месяц (отчетный период), не позднее 10 числа следующего месяца, путем их перечисления на банковскую пластиковую карту, данные которой предоставили Преподаватели для таких целей. 
4.4.1. Выплата, причитающаяся Преподавателям, будет направлена им за вычетом стоимости услуг MY DARS, исходя из условий п.4.2. настоящего Соглашения. 
4.4.2. Ответственность за предоставление не верной или не актуальной информации, касательно данных банковской пластиковой карты, Преподаватели несут самостоятельно, а задержка за несвоевременное проведение расчетов будет считаться по вине Преподавателя.    
5. Ответственность сторон
5.1. В случае неисполнения или ненадлежащего исполнения своих обязательств по настоящему Соглашению Стороны несут ответственность в соответствии с действующим законодательством Республики Узбекистан.
5.2. За нарушение сроков оказания услуг, определенных и согласованных между Преподавателем и Пользователем, Преподаватель несет персональную материальную ответственность перед Пользователем, и по его требованию через Платформу, Преподавателю не засчитывается сумма выплат за несостоявшиеся занятия или занятия, которые были оказаны некачественно и Пользователь ими не удовлетворён. При систематичном нарушении сроков и качества оказания услуг Преподавателем, My Dars вправе уменьшить рейтинг Преподавателя, временно заблокировать или прекратить с ним сотрудничество. 
5.3. Преподаватель самостоятельно уплачивает все необходимые налоги и платежи и несет ответственность за своевременное и правильное их исчисление и уплату.
5.4. В случае, если Платформа понесла убытки в результате несоблюдения Преподавателем условий пунктов 5.2., 5.3. настоящего Соглашения,  Преподаватель(и) обязан(ы) возместить Платформа все подтвержденные убытки.
5.5. Стороны несут ответственность за безопасность и неразглашение персональных данных друг друга и третьих лиц, ставших им известными в рамках настоящего Соглашения. В целях охраны персональных данных пользователей, клиентов и Сторон, Преподаватель/Клиент обязан ознакомиться с Политикой конфиденциальности https://mydars.uz/docs/privacy_policy . 
5.6. Платформа не несёт ответственность за непредоставление услуг или их ненадлежащее качество, если причиной стало отсутствие необходимого программного обеспечения, технические проблемы с подключением к Интернету либо иные технические неполадки, сбой и др., возникших не по вине Платформы. Однако Платформа примет все усилия, для положительного разрешения ситуации в кратчайшие (разумные) сроки.
6. Порядок разрешения споров 
6.1. Споры и разногласия, которые могут возникнуть при исполнении настоящего Соглашения, будут по возможности разрешаться путем переговоров между Сторонами. 
6.2. Соблюдение претензионного порядка обязателен. Срок рассмотрения претензии Сторон 15 календарных дней.
6.3. В случае если Стороны не придут к соглашению, споры разрешаются в судебном порядке, в соответствии с действующим законодательством Республики Узбекистан, в Ташкентском межрайонном экономическом суде. 
7. Заключительные положения 
7.1. Настоящее Соглашение вступает в силу с момента принятия/нажатия Преподавателем кнопки о согласии/принятии во время регистрации на сайте mydars.uz. Данное действие приравнивается к принятию всех условий настоящего Соглашения Преподавателем, в соответствии со статьями 367-378 Гражданского кодекса Республики Узбекистан.
7.2. В настоящее Соглашение могут вноситься изменения в одностороннем порядке, о чем будет направлено/выложено соответствующее уведомление для Преподавателей, за 10 календарных дней до вступления в силу таких изменений. При этом акцептирование считается автоматическим.
7.3. Во всем остальном, что не предусмотрено настоящим Соглашением, Стороны руководствуются положениями и условиями Пользовательского Соглашения с конечным пользователем об оказании услуг https://mydars.uz/docs/terms_and_conditions , а также законодательством Республики Узбекистан. 
  Реквизиты  и контакты
OOO «MY DARS» Республика Узбекистан 100031, ул. Кухинур, Богсарой махаля, Яккасарайский район, дом 1/1 
ИНН: 307897255 МФО: 00421 ОКЭД: 58290
Р/С: 2020 8000 7053 0519 1001
в АИКБ «Ипак Йули Банк» Мирзо Улугбекского филиала
+998 71 205 87 00
 +998 99 353 68 98
support@mydars.uz 
        </div>
    )
}
}

export default Fr1;